
[Jzip Language File]

[General]
lang_name		=English
lang_codepage		=437
lang_translators	=dennishaha
txt_title		=JFsoft Zip


[Setting Lnk]
set_lnk.jzip.name	=Jzip
set_lnk.open.name	=Jzip - Open
set_lnk.unzip.name	=Jzip - Extract to folder
set_lnk.add.name	=Jzip - Add to Archive
set_lnk.add7z.name	=Jzip - Add to .7z


[Text]
txt_tabs.1		=─
txt_tabs.2		=│
txt_tabs.3		=┌
txt_tabs.4		=└
txt_tabs.5		=┐
txt_tabs.6		=┘
txt_tabs.1.r		=──
txt_tabs.2.r		=│ 
txt_tabs.3.r		=┌─
txt_tabs.4.r		=└─
txt_tabs.5.r		=┐ 
txt_tabs.6.r		=┘ 

txt_sym.back		=《
txt_sym.delim		=│
txt_sym.squ		=..
txt_sym.squ.s		=##
txt_sym.cir		=..
txt_sym.cir.s		=##


[Text VBSBox]
txt_tips		=Notice
txt_notzip		=The following items are not compressed files.
txt_cantadd		=Cannot be added to the following compressed file.


[Text Main]
txt_b12.top		=┌──────────┐
txt_b12.emp		=│                    │
txt_b12.bot		=└──────────┘
txt_m.open		=│   Open Archive     │
txt_m.add		=│    New Archive     │
txt_m.set		=│      Setting       │


[Text Arc]
txt_e.home		=Home
txt_e.open		=Open
txt_e.extr		=Extr
txt_e.unzip		=UnZip 
txt_e.add		=Add 
txt_e.del		=Del 
txt_e.rn		=ReName
txt_e.adv		=Adv.
txt_e.up		= Up 
txt_e.down		=Down
txt_e.ent		=Entr
txt_e.back		=Back
txt_e.basic		=Back
txt_e.test		=Test
txt_e.fix		=Fix 
txt_e.lock		=Lock
txt_e.rem		=Remark
txt_e.sfx		=SFX-Trans 
txt_e.search		=Find

txt_e.bar.7z		=   Date      Time    Attr         Size   Compressed  .. Name
txt_e.bar.rar		=     Attr        Size     Date     Time  .. Name

txt_pages		=Page(s)
txt_selected		=Selected:
txt_item		=Item(s)
txt_items		=Item(s)

txt_sfx			=Sfx
txt_solid		=Solid
txt_lock		=Lock
txt_volume		=Volume
txt_recovery_record	=Recovery Record

txt_e.type.enterfold	=Enter the folder:
txt_e.type.search	=Searched field:


[Text Arc Expan]
txt_x.type.open		=Please enter the file name to open:
txt_x.type.extr		=Please enter the file or folder name to extract:
txt_x.type.del		=Please enter the file or folder name to delete:
txt_x.type.rn		=Please enter the file or folder name to delete:
txt_x.type.rn.new	=Please enter a new name for this item:
txt_x.wildcard		=Wildcards can be used.
txt_x.totmp		=The files will be placed in a temporary folder.

txt_x.exetakeall	=The application may need to have the files it ships with Extract all the files?
txt_x.del.confirm	=Are you sure you want to delete the following items?
txt_x.lock.confirm	=Cannot modify after locking the compressed file, confirm the lock?
txt_x.zip.deled		=The Archive has been deleted.


[Text Arc Sfx]
txt_as.tip.add		=Create a copy with a Windows SFX module
txt_as.tip.re		=Update self-extracting file module

txt_b13.top		=┌───────────┐
txt_b13.emp		=│                      │
txt_b13.bot		=└───────────┘
txt_as.b.sfx		=│   Self-Extracting    │

txt_b8.top		=┌──────┐
txt_b8.bot		=└──────┘
txt_as.b.64		=│   64 bit   │
txt_as.b.con		=│  Console   │
txt_as.b.con64		=│ Console,64 │

txt_b16.top		=┌──────────────┐
txt_b16.emp		=│                            │
txt_b16.bot		=└──────────────┘
txt_as.b.add		=│    Create a No-SFX Copy    │


[Text Add]

[keep in 2 tabs]
txt_aa.addtozip		=Add files to Archive
txt_aa.zipname		=Archive Name
txt_aa.type		=Format	
txt_aa.eff		=Efficiency
txt_aa.solid		=Solid	
txt_aa.split		=Split to vols
txt_aa.sfxmode		=Self Release
txt_aa.encry		=Encryption
txt_aa.compati		=Compatibility
txt_aa.record		=Recovery Record
[End]

txt_aa.addto 		=Add to
txt_aa.setpath		=Set Path
txt_aa.scan		=Scan

txt_aa.sfx.origin	=Origin Module
txt_aa.sfx.a		=Standard
txt_aa.sfx.b		=Console
txt_aa.sfx.64		= with 64bit

txt_aa.eff.0		=Storage
txt_aa.eff.1		=Fastest
txt_aa.eff.2		=Fast
txt_aa.eff.3		=Default
txt_aa.eff.4		=Well
txt_aa.eff.5		=Best

txt_b7.top		=┌─────┐
txt_b7.bot		=└─────┘
txt_b7.confirm		=│ Confirm  │
txt_b7.cancel		=│  Cancel  │

[Text Add Set]
txt_aas.zipname		=Set the Archive name:
txt_aas.split		=Set the Archive volume size:
txt_aas.unit		=[Size/Unit] k/m/g
txt_aas.passwd		=Set the Archive password:



[Text Setting]
txt_setting		=Setting
txt_assoc		=Archive association
txt_rightmenu		=Right-click extension
txt_shortcut		=Desktop shortcut
txt_colorset		=UI color
txt_uiratio		=UI ratio
txt_workdir		=Working directory
txt_version		=Version
txt_uninstall		=Uninstall

txt_b5.top		=┌───┐
txt_b5.bot		=└───┘
txt_s.b.open		=│ Open │
txt_s.b.clean		=│Clean │
txt_s.b.ctm		=│ Set  │
txt_s.b.def		=│Reset │

txt_b6.top		=┌────┐
txt_b6.bot		=└────┘
txt_s.b.chk		=│Upgrade │
txt_s.b.bm		=│Be-Mark │
txt_s.b.site		=│Website │

txt_langset		=Language
txt_lang.chs	 	=Simplified Chinese
txt_lang.en	 	=English

txt_s.clean.ok		=The temporary file cleanup is complete.
txt_s.clean.err		=There was a problem cleaning the temporary file. Please try again later.
txt_s.need.emp		=Please select an empty folder and try again.
txt_s.fold_invalid	=This folder cannot be selected. Please select another folder.
txt_s.bm.ok		=The benchmark is complete.


[Text EditorCode]
txt_edcode		=Return code:
txt_edcode.1		=A serious error has occurred.
txt_edcode.2		=A general error has occurred.
txt_edcode.3		=The checksum is invalid and the data is corrupted.
txt_edcode.4		=Locked compressed files cannot be modified.
txt_edcode.5		=Write error occurred.
txt_edcode.6		=The file is open incorrectly.
txt_edcode.7		=Bad command line options.
txt_edcode.8		=Running out of memory.
txt_edcode.9		=File creation error.
txt_edcode.10		=No files were found matching the specified mask and options.
txt_edcode.11		=Incorrect password.
txt_edcode.255		=Interrupted by the user.


[Text Color]
txt_color.0		=BK
txt_color.1		=BU
txt_color.2		=GN
txt_color.3		=CY
txt_color.4		=RD
txt_color.5		=VT
txt_color.6		=YE
txt_color.7		= GY 
txt_color.8		=L-GY
txt_color.9		=L-BU
txt_color.a		=L-GN
txt_color.b		=L-CY
txt_color.c		=L-RD
txt_color.d		=L-VT
txt_color.e		=L-YE
txt_color.f		=WH

txt_color.light		=Light Mode
txt_color.dark		=Dark Mode
txt_color.auto		=Automatic

txt_color.title		=Jzip Color Setting
txt_color.tip		=Custom
txt_color.wd		=Text
txt_color.bg		=Wall
txt_color.swd		=Set wall
txt_color.sbg		=Set text
txt_b7.finish		=│ Complete │


[Text UIRatio]
txt_uiratio.s		=Small
txt_uiratio.m		=Medium
txt_uiratio.l		=Large


[Text Help]
txt.rightres		=All rights reserved.
txt.usage		=Usage
txt.switch		=Switch
txt.command		=Command
txt.files		=Files
txt.archives		=Archives

txt.h.help		=View help.
txt.h.su		=Start Jzip with administrator privileges.
txt.h.install		=Start Jzip in install mode.
txt.h.setting		=Start Jzip and go to the settings page.
txt.h.@			=View archive.
txt.h.add		=Add file to Archive.
txt.h.unzip		=Unzip the archive to a subfolder.
